src/cf/Documents/ВозвратПодарочныхСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВозвратПодарочныхСертификатов</Name>
			<Comment>Добавил Шаравин Евгений 19.05.2025 по проектной работе курса "Архитектор 1С" (УЦ ОТУС)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПодарочныеСертификаты</xr:Item>
				<xr:Item>InformationRegister.ИсторияСтатусовПодарочныхСертификатов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодарочныеСертификаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодарочныйСертификат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодарочныеСертификаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/AccumulationRegisters/ПодарочныеСертификаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПодарочныеСертификаты</Name>
			<Comment>Добавил Шаравин Евгений 18.05.2025 по проектной работе курса "Архитектор 1С" (УЦ ОТУС)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодарочныеСертификаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ИсторияСтатусовПодарочныхСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСтатусовПодарочныхСертификатов</Name>
			<Comment>Добавил Шаравин Евгений 18.05.2025 по проектной работе курса "Архитектор 1С" (УЦ ОТУС)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПодарочныхСертификатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодарочныеСертификаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтатусыПодарочныхСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыПодарочныхСертификатов</Name>
			<Comment>Добавил Шаравин Евгений 18.05.2025 по проектной работе курса "Архитектор 1С" (УЦ ОТУС)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выпущен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Активирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноИспользован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолностьюИспользован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ВозвратПодарочныхСертификатов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ПодарочныеСертификатыСервер.УдалитьСтрокиДокументаСНесуществующимиПодарочнымиСертификатами(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	ПодарочныеСертификатыСервер.ПроверитьНаличиеДублейПодарочныхСертификатовВДокументе(ЭтотОбъект, "ПодарочныеСертификаты", Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СтатусВозвращен = Перечисления.СтатусыПодарочныхСертификатов.Возвращен;
	
	ПодарочныеСертификатыСервер.УдалитьДвиженияДокументаПриПерепроведенииИУстановитьПризнакиЗаписиВРегистры(Движения);
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.ПодарочныеСертификаты");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ПодарочныеСертификаты;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ПодарочныйСертификат", "ПодарочныйСертификат");
	
	БлокировкаДанных.Заблокировать();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратПодарочныхСертификатовПодарочныеСертификаты.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	ВозвратПодарочныхСертификатовПодарочныеСертификаты.ПодарочныйСертификат.Владелец.Возвратный КАК Возвратный,
		|	ВозвратПодарочныхСертификатовПодарочныеСертификаты.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_ПодарочныеСертификаты
		|ИЗ
		|	Документ.ВозвратПодарочныхСертификатов.ПодарочныеСертификаты КАК ВозвратПодарочныхСертификатовПодарочныеСертификаты
		|ГДЕ
		|	ВозвратПодарочныхСертификатовПодарочныеСертификаты.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсторияСтатусовПодарочныхСертификатовСрезПоследних.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	ИсторияСтатусовПодарочныхСертификатовСрезПоследних.Статус КАК Статус
		|ПОМЕСТИТЬ ВТ_СтатусыПодарочныхСертификатов
		|ИЗ
		|	РегистрСведений.ИсторияСтатусовПодарочныхСертификатов.СрезПоследних(
		|			&Дата,
		|			ПодарочныйСертификат В
		|				(ВЫБРАТЬ
		|					ВТ_ПодарочныеСертификаты.ПодарочныйСертификат КАК ПодарочныйСертификат
		|				ИЗ
		|					ВТ_ПодарочныеСертификаты КАК ВТ_ПодарочныеСертификаты)) КАК ИсторияСтатусовПодарочныхСертификатовСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПодарочныйСертификат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсторияСтатусовПодарочныхСертификатов.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	МАКСИМУМ(ИсторияСтатусовПодарочныхСертификатов.ДействуетДо) КАК ДействуетДо
		|ПОМЕСТИТЬ ВТ_СрокиДействияПодарочныхСертификатов
		|ИЗ
		|	РегистрСведений.ИсторияСтатусовПодарочныхСертификатов КАК ИсторияСтатусовПодарочныхСертификатов
		|ГДЕ
		|	ИсторияСтатусовПодарочныхСертификатов.ПодарочныйСертификат В
		|			(ВЫБРАТЬ
		|				ВТ_ПодарочныеСертификаты.ПодарочныйСертификат КАК ПодарочныйСертификат
		|			ИЗ
		|				ВТ_ПодарочныеСертификаты КАК ВТ_ПодарочныеСертификаты)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсторияСтатусовПодарочныхСертификатов.ПодарочныйСертификат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодарочныеСертификатыОстатки.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	ПодарочныеСертификатыОстатки.СуммаОстаток КАК НеиспользованныйОстатокСтоимости
		|ПОМЕСТИТЬ ВТ_НеиспользованныеОстаткиСтоимостиСертификатов
		|ИЗ
		|	РегистрНакопления.ПодарочныеСертификаты.Остатки(
		|			&Дата,
		|			ПодарочныйСертификат В
		|				(ВЫБРАТЬ
		|					ВТ_ПодарочныеСертификаты.ПодарочныйСертификат КАК ПодарочныйСертификат
		|				ИЗ
		|					ВТ_ПодарочныеСертификаты КАК ВТ_ПодарочныеСертификаты)) КАК ПодарочныеСертификатыОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПодарочныйСертификат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодарочныеСертификаты.ПодарочныйСертификат КАК ПодарочныйСертификат,
		|	ПодарочныеСертификаты.НомерСтроки КАК НомерСтроки,
		|	ПодарочныеСертификаты.Возвратный КАК Возвратный,
		|	ЕСТЬNULL(ВТ_СтатусыПодарочныхСертификатов.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.Активирован), ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.ЧастичноИспользован)) КАК СертификатАктивирован,
		|	КОНЕЦПЕРИОДА(ЕСТЬNULL(ВТ_СрокиДействияПодарочныхСертификатов.ДействуетДо, ДАТАВРЕМЯ(1, 1, 1)), ДЕНЬ) КАК ДействуетДо,
		|	ЕСТЬNULL(ВТ_НеиспользованныеОстаткиСтоимостиСертификатов.НеиспользованныйОстатокСтоимости, 0) КАК НеиспользованныйОстатокСтоимости
		|ИЗ
		|	ВТ_ПодарочныеСертификаты КАК ПодарочныеСертификаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусыПодарочныхСертификатов КАК ВТ_СтатусыПодарочныхСертификатов
		|		ПО ПодарочныеСертификаты.ПодарочныйСертификат = ВТ_СтатусыПодарочныхСертификатов.ПодарочныйСертификат
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрокиДействияПодарочныхСертификатов КАК ВТ_СрокиДействияПодарочныхСертификатов
		|		ПО ПодарочныеСертификаты.ПодарочныйСертификат = ВТ_СрокиДействияПодарочныхСертификатов.ПодарочныйСертификат
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НеиспользованныеОстаткиСтоимостиСертификатов КАК ВТ_НеиспользованныеОстаткиСтоимостиСертификатов
		|		ПО ПодарочныеСертификаты.ПодарочныйСертификат = ВТ_НеиспользованныеОстаткиСтоимостиСертификатов.ПодарочныйСертификат
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПодарочныеСертификаты.НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", ?(Режим = РежимПроведенияДокумента.Оперативный, Неопределено, МоментВремени()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПутьКТабличнойЧасти = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ПодарочныеСертификаты", ВыборкаДетальныеЗаписи.НомерСтроки, "ПодарочныйСертификат");
		
		Если НЕ ВыборкаДетальныеЗаписи.Возвратный Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'В строке %1 подарочный сертификат не является возвратным!'"), ВыборкаДетальныеЗаписи.НомерСтроки), ЭтотОбъект, ПутьКТабличнойЧасти, , Отказ);
		КонецЕсли;
		
		Если НЕ ВыборкаДетальныеЗаписи.СертификатАктивирован Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'В строке %1 подарочный сертификат не был активирован ранее (или уже полностью использован)!'"), ВыборкаДетальныеЗаписи.НомерСтроки), ЭтотОбъект, ПутьКТабличнойЧасти, , Отказ);
		ИначеЕсли ВыборкаДетальныеЗаписи.НеиспользованныйОстатокСтоимости = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'В строке %1 номинальная стоимость подарочного сертификата полностью погашена!'"), ВыборкаДетальныеЗаписи.НомерСтроки), ЭтотОбъект, ПутьКТабличнойЧасти, , Отказ);
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.ДействуетДо < Дата Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'В строке %1 истек срок действия подарочного сертификата!'"), ВыборкаДетальныеЗаписи.НомерСтроки), ЭтотОбъект, ПутьКТабличнойЧасти, , Отказ);
		КонецЕсли;
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ИсторияСтатусовПодарочныхСертификатов.Добавить();
		Движение.Период = Дата;
		Движение.ПодарочныйСертификат = ВыборкаДетальныеЗаписи.ПодарочныйСертификат;
		Движение.Статус = СтатусВозвращен;
		Движение.Ответственный = Ответственный;
		
		Движение = Движения.ПодарочныеСертификаты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ПодарочныйСертификат = ВыборкаДетальныеЗаписи.ПодарочныйСертификат;
		Движение.Сумма = ВыборкаДетальныеЗаписи.НеиспользованныйОстатокСтоимости;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ПодарочныеСертификатыСервер.ВыполнитьКонтрольПриОтменеПроведенияДокумента(Ссылка, Отказ);
КонецПроцедуры

#КонецОбласти

#КонецЕсли
